Revit 2027 API
ProjectBrowserOptions Class
 Provides access to settings that control Revit's Project Browser appearance and functionality.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ProjectBrowserOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProjectBrowserOptions : IDisposable
Public Class ProjectBrowserOptions
	Implements IDisposable
public ref class ProjectBrowserOptions : IDisposable
type ProjectBrowserOptions =
    class
        interface IDisposable
    end
The ProjectBrowserOptions type exposes the following members.
Properties
Name | Description
AutoExpandSheetViewsOnViewPlacement |  Auto expand sheet views on view placement.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowViewPlacementOnSheetStatusIcons |  Show the icons indicating view placement on sheet status.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ProjectBrowserOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetProjectBrowserOptions |  Returns the current Revit instance's ProjectBrowserOptions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
See Also
Reference
Autodesk.Revit.UI Namespace